In [1]:
import pandas as pd
import numpy as np

In [88]:
data = pd.read_csv('xy.txt',sep='\t') # 1996 - 2002
data = data.drop('Notes',axis=1).dropna()
data.head()

,State,State Code,Year,Year Code,Age of Mother,Age of Mother Code,Births
0,Alabama,1.0,1995.0,1995.0,Under 15 years,15,324.0
1,Alabama,1.0,1995.0,1995.0,15-19 years,15-19,10857.0
2,Alabama,1.0,1995.0,1995.0,20-24 years,20-24,18467.0
3,Alabama,1.0,1995.0,1995.0,25-29 years,25-29,15400.0
4,Alabama,1.0,1995.0,1995.0,30-34 years,30-34,10746.0

In [125]:
data2 = pd.read_csv('xxy.txt',sep='\t') # 2002-2006
data2 = data2.drop('Notes',axis=1).dropna()
data2 = data2[data2['Age of Mother Year Code'].isin(np.char.mod('%d', np.arange(15,20)))]
data2.head()

,State,State Code,Year,Year Code,Age of Mother Year,Age of Mother Year Code,Births
1,Alabama,1.0,2003.0,2003.0,15 years,15,405.0
2,Alabama,1.0,2003.0,2003.0,16 years,16,800.0
3,Alabama,1.0,2003.0,2003.0,17 years,17,1460.0
4,Alabama,1.0,2003.0,2003.0,18 years,18,2301.0
5,Alabama,1.0,2003.0,2003.0,19 years,19,3129.0

In [126]:
data3 = pd.read_csv('xxxy.txt',sep='\t') # 2007-2016
data3 = data3.drop('Notes',axis=1).dropna()
data3 = data3[data3['Age of Mother Year Code'].isin(np.char.mod('%d', np.arange(15,20)))]
data3.head()

,State,State Code,Year,Year Code,Age of Mother Year,Age of Mother Year Code,Births
2,Alabama,1.0,2007.0,2007.0,15 years,15,366.0
3,Alabama,1.0,2007.0,2007.0,16 years,16,860.0
4,Alabama,1.0,2007.0,2007.0,17 years,17,1589.0
5,Alabama,1.0,2007.0,2007.0,18 years,18,2480.0
6,Alabama,1.0,2007.0,2007.0,19 years,19,3401.0

In [128]:
all_data = pd.concat([ data2, data3])
all_data.head()

,State,State Code,Year,Year Code,Age of Mother Year,Age of Mother Year Code,Births
1,Alabama,1.0,2003.0,2003.0,15 years,15,405.0
2,Alabama,1.0,2003.0,2003.0,16 years,16,800.0
3,Alabama,1.0,2003.0,2003.0,17 years,17,1460.0
4,Alabama,1.0,2003.0,2003.0,18 years,18,2301.0
5,Alabama,1.0,2003.0,2003.0,19 years,19,3129.0

In [129]:
all_data['Age'] = all_data['Age of Mother Year Code']
all_data = all_data.drop(['Age of Mother Year','Age of Mother Year Code','Year Code','State Code'],axis=1).dropna()
all_data.head()

     State    Year  Births Age
1  Alabama  2003.0   405.0  15
2  Alabama  2003.0   800.0  16
3  Alabama  2003.0  1460.0  17
4  Alabama  2003.0  2301.0  18
5  Alabama  2003.0  3129.0  19

In [130]:
all_data.shape

(3554, 4)

In [122]:
all_data.State.unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi', 'Missouri',
       'Montana', 'Nebraska', 'Nevada', 'New Hampshire', 'New Jersey',
       'New Mexico', 'New York', 'North Carolina', 'North Dakota', 'Ohio',
       'Oklahoma', 'Oregon', 'Pennsylvania', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Tennessee', 'Texas', 'Utah',
       'Vermont', 'Virginia', 'Washington', 'West Virginia', 'Wisconsin',
       'Wyoming'], dtype=object)

In [123]:
all_data.Age.unique()

array(['15', '16', '17', '18', '19'], dtype=object)

In [124]:
all_data.Year.unique()

array([ 2003.,  2004.,  2005.,  2006.,  2007.,  2008.,  2009.,  2010.,
        2011.,  2012.,  2013.,  2014.,  2015.,  2016.])

In [132]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
writer = pd.ExcelWriter('natality_1996_2016.xlsx', engine='xlsxwriter')

# Convert the dataframe to an XlsxWriter Excel object.
all_data.to_excel(writer, sheet_name='Sheet1')

# Close the Pandas Excel writer and output the Excel file.
writer.save()